constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          704;
        startFace       85209;
    }
    outlet
    {
        type            patch;
        nFaces          704;
        startFace       85913;
    }
    container
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9966;
        startFace       86617;
    }
    atmosphere
    {
        type            patch;
        nFaces          928;
        startFace       96583;
    }
)

// ************************************************************************* //
