system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
|  =========                 |                                                |
|  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox          |
|   \\    /   O peration     | Version:  v2012                                |
|    \\  /    A nd           | Website:  www.openfoam.com                     |
|     \\/     M anipulation  |                                                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (0 0 0) (0.5 0.085 0.15);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);


// ************************************************************************* //
